src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <owners>Catalog.Кластеры1С</owners>
  <attributes>
    <name>ИмяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверБД</name>
    <type>
      <types>CatalogRef.СерверыБД</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторБазы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВКластере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКонфигурации</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебСервер</name>
    <type>
      <types>CatalogRef.ВебСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступ</name>
    <attributes>
      <name>ПользовательГруппа</name>
      <type>
        <types>CatalogRef.ПользователиИБ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>ИмяРасширения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеРасширения</name>
      <type>
        <types>CatalogRef.ХранилищаКонфигураций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WebСервисы</name>
    <attributes>
      <name>ИмяСервиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>HTTPСервисы</name>
    <attributes>
      <name>ИмяСервиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВебСерверы</name>
    <attributes>
      <name>ВебСервер</name>
      <type>
        <types>CatalogRef.ВебСерверы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/Сценарий/Сценарий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сценарий</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>СозданиеПустойИнформационнойБазы</name>
      <description>Создание пустой информационной базы</description>
    </items>
    <items>
      <name>СозданиеНовойИнформационнойБазы</name>
      <description>Создание новой информационной базы</description>
    </items>
    <items>
      <name>СозданиеДемоБазы</name>
      <description>Создание демо базы</description>
    </items>
    <items>
      <name>СозданиеКопииИнформационнойБазы</name>
      <description>Создание копии информационной базы</description>
    </items>
  </predefined>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТаблицаСкриптов</name>
    <attributes>
      <name>Скрипт</name>
      <type>
        <types>CatalogRef.Скрипты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КонтекстВыполнения</name>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ИнформационныеБазы/Forms/ФормаНовойБазы/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения); 
	КоличествоДнейИспользования = 1;
	
	Если ЗначениеЗаполнено(Параметры.Кластер1С) Тогда
		Объект.Владелец = Параметры.Кластер1С;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Владелец) Тогда
		Элементы.Кластер1С.Видимость = Ложь;
	Иначе
		Элементы.Кластер1СПредставление.Видимость = Ложь;
	КонецЕсли;
	
	Объект.Проект = Параметры.Проект;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Модифицированность = Ложь;
	ПриЗакрытииПомощника(Отказ);

КонецПроцедуры

&НаКлиенте
Асинх Процедура ПриЗакрытииПомощника(Отказ)
	
	ОжиданиеОтветаНаВопрос = ВопросАсинх("Закрыть помощник создания информационной базы?", РежимДиалогаВопрос.ДаНет, , , , );
	
	Результат = Ждать ОжиданиеОтветаНаВопрос;
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		Отказ = Ложь;
	Иначе
		Отказ = Истина;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхБазыПриИзменении(Элемент)
	
	МассивСтраниц = Новый Массив;
	МассивСтраниц.Добавить("ГруппаПустаяБаза");
	МассивСтраниц.Добавить("ГруппаКопияБазы");
	МассивСтраниц.Добавить("ГруппаНоваяБаза");
	МассивСтраниц.Добавить("ГруппаДемоБаза");
	
	ИмяТекущейСтраницы = МассивСтраниц[ИсточникДанныхБазы];
	Элементы.СтраницыВыбораИсточника.ТекущаяСтраница = Элементы[ИмяТекущейСтраницы];

	Элементы.КопияБазы.Доступность			= (ИсточникДанныхБазы = 1);
	Элементы.Конфигурация.Доступность		= (ИсточникДанныхБазы = 2);
	Элементы.КонфигурацияДемо.Доступность	= (ИсточникДанныхБазы = 3);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьПараметровИсточника()
	
	Элементы.КопияБазы.Доступность			= (ИсточникДанныхБазы = 1);
	Элементы.Конфигурация.Доступность		= (ИсточникДанныхБазы = 2);
	Элементы.КонфигурацияДемо.Доступность	= (ИсточникДанныхБазы = 3);
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхБазыПустаяБазаПриИзменении(Элемент)
	
	УстановитьДоступностьПараметровИсточника();

КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхБазыКопияБазыПриИзменении(Элемент)
	
	УстановитьДоступностьПараметровИсточника();

КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхБазыНоваяБазаПриИзменении(Элемент)
	
	УстановитьДоступностьПараметровИсточника();

КонецПроцедуры

&НаКлиенте
Процедура ИсточникДанныхБазыДемоБазаПриИзменении(Элемент)
	
	УстановитьДоступностьПараметровИсточника();

КонецПроцедуры


&НаКлиенте
Процедура ОсновныеПараметрыДалее(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.ДополнительныеПараметры;

КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеПараметрыДалее(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.СтраницаПостЗаполнения;
	
КонецПроцедуры


&НаКлиенте
Процедура ДополнительныеПараметрыНазад(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.ОсновныеПараметры;

КонецПроцедуры


&НаКлиенте
Процедура ПостЗаполнениеНазад(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.ДополнительныеПараметры;

КонецПроцедуры

&НаКлиенте
Процедура ПостЗаполнениеДалее(Команда)

//	Если ИсточникДанныхБазы = 0 И Объект.ВебСерверы.Количество() = 0 Тогда
//		Элементы.СтраницыСценарииПусто.ТекущаяСтраница = Элементы.ПустойСценарий;
//	Иначе
//		ЗаполнитьСтрокиСценария();
//		Элементы.СтраницыСценарииПусто.ТекущаяСтраница = Элементы.Сценарий;
//	КонецЕсли;
	
	Если ИсточникДанныхБазы = 0 Тогда
		Сценарий = ПредопределенноеЗначение("Справочник.Сценарий.СозданиеПустойИнформационнойБазы");
	ИначеЕсли ИсточникДанныхБазы = 1 Тогда
		Сценарий = ПредопределенноеЗначение("Справочник.Сценарий.СозданиеКопииИнформационнойБазы");
	ИначеЕсли ИсточникДанныхБазы = 2 Тогда
		Сценарий = ПредопределенноеЗначение("Справочник.Сценарий.СозданиеДемоБазы");
	ИначеЕсли ИсточникДанныхБазы = 3 Тогда
		Сценарий = ПредопределенноеЗначение("Справочник.Сценарий.СозданиеНовойИнформационнойБазы");
	КонецЕсли;
	
	ЗаполнитьСтрокиСценария();
	
	Элементы.СтраницыСценарииПусто.ТекущаяСтраница = Элементы.Сценарий;
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.СтраницаСценария;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтрокиСценария()

	ТаблицаСценария.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
					|	СценарийТаблицаСкриптов.Скрипт КАК СкриптСценария,
					|	СценарийТаблицаСкриптов.Скрипт.Описание КАК ОписаниеДействия
					|ИЗ
					|	Справочник.Сценарий.ТаблицаСкриптов КАК СценарийТаблицаСкриптов
					|ГДЕ
					|	СценарийТаблицаСкриптов.Ссылка = &Ссылка
					|
					|УПОРЯДОЧИТЬ ПО
					|	СценарийТаблицаСкриптов.НомерСтроки";
	
	Запрос.УстановитьПараметр("Ссылка", Сценарий);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	НомерШага = 1;
	Пока Выборка.Следующий() Цикл
		НоваяСтрокаСценария = ТаблицаСценария.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСценария, Выборка);
		НоваяСтрокаСценария.НомерШага = НомерШага;

		НомерШага = НомерШага + 1;	
	КонецЦикла;

//	Если ИсточникДанныхБазы = 1 Тогда
//		
//		НоваяСтрокаСценария = ТаблицаСценария.Добавить();
//		НоваяСтрокаСценария.НомерШага = 1;
//		НоваяСтрокаСценария.СкриптСценария = Справочники.Скрипты.ВыгрузитьБазуВФайл;
//		НоваяСтрокаСценария.ОписаниеДействия = Справочники.Скрипты.ВыгрузитьБазуВФайл.Описание;
//			
//		НоваяСтрокаСценария = ТаблицаСценария.Добавить();
//		НоваяСтрокаСценария.НомерШага = 2;
//		НоваяСтрокаСценария.СкриптСценария = Справочники.Скрипты.ЗагрузитьБазуИзФайла;
//		НоваяСтрокаСценария.ОписаниеДействия = Справочники.Скрипты.ЗагрузитьБазуИзФайла.Описание;
//		
//	ИначеЕсли ИсточникДанныхБазы = 2 Тогда
//		
//		НоваяСтрокаСценария = ТаблицаСценария.Добавить();
//		НоваяСтрокаСценария.НомерШага = 1;
//		НоваяСтрокаСценария.СкриптСценария = Справочники.Скрипты.ЗагрузитьКонфигурацию;
//		НоваяСтрокаСценария.ОписаниеДействия = Справочники.Скрипты.ЗагрузитьКонфигурацию.Описание;
//	
//	ИначеЕсли ИсточникДанныхБазы = 3 Тогда
//		
//		НоваяСтрокаСценария = ТаблицаСценария.Добавить();
//		НоваяСтрокаСценария.НомерШага = 1;
//		НоваяСтрокаСценария.СкриптСценария = Справочники.Скрипты.ЗагрузитьБазуИзФайла;
//		НоваяСтрокаСценария.ОписаниеДействия = Справочники.Скрипты.ЗагрузитьБазуИзФайла.Описание;
//		
//	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияОчиститьНажатие(Элемент)
	
	КоличествоДнейИспользования = 0;
	ОтобразитьДнейИспользования();

КонецПроцедуры

&НаКлиенте
Процедура СценарииНазад(Команда)
	
	Элементы.СтраницыШагов.ТекущаяСтраница = Элементы.СтраницаПостЗаполнения;

КонецПроцедуры

&НаКлиенте
Процедура ИспользуетсяПоНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыВыбораДаты = Новый Структура("НачальноеЗначение", Объект.ИспользуетсяПо);
	ОткрытьФорму("ОбщаяФорма.ВыборДаты", ПараметрыВыбораДаты, ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ВРег(ИсточникВыбора.ИмяФормы) = ВРег("ОбщаяФорма.ВыборДаты") Тогда
		
		Если ВыбранноеЗначение = Неопределено Тогда
			Возврат;
		КонецЕсли;

		Если НачалоДня(ВыбранноеЗначение) <= НачалоДня(ТекущаяДата()) Тогда
			ПоказатьПредупреждение(, "Выбраная дата должна быть больше текущей!");
			Возврат;
		КонецЕсли; 
		
		СекундВСутках = 24*60*60;
		
		Объект.ИспользуетсяПо = ВыбранноеЗначение;
		КоличествоДнейИспользования = (Объект.ИспользуетсяПо - НачалоДня(ТекущаяДата())) / СекундВСутках;
		Элементы.КоличествоДнейИспользования.Заголовок = "Срок использования (" + Строка(КоличествоДнейИспользования) + " дн.)";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КоличествоДнейИспользованияПриИзменении(Элемент)
	
	ОтобразитьДнейИспользования();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразитьДнейИспользования()
	
	Если КоличествоДнейИспользования = 0 Тогда
		Элементы.КоличествоДнейИспользования.Заголовок = "Используется бессрочно";
		Объект.ИспользуетсяПо = Дата("00010101");
	Иначе	
		Элементы.КоличествоДнейИспользования.Заголовок = "Срок использования (" + Строка(КоличествоДнейИспользования) + " дн.)";
		Объект.ИспользуетсяПо = НачалоДня(ТекущаяДата()) + КоличествоДнейИспользования * 24*60*60;
	КонецЕсли;	

КонецПроцедуры // ОтобразитьДнейИспользования()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразитьДнейИспользования();
	УстановитьДоступностьПараметровИсточника();
	
КонецПроцедуры

&НаКлиенте
Процедура СценарииГотово(Команда)
	
	Отказ = Не ПроверитьЗаполнение();

КонецПроцедуры

&НаКлиенте
Процедура ИмяБазыПриИзменении(Элемент)
	
	Объект.БазаДанных = Объект.ИмяИБ;
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = Объект.ИмяИБ;	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ИмяБазыИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	// TODO: Проверка на только латинские

КонецПроцедуры
